'''字符串格式化'''
num1=123456
str1="XXX"
bool1=bool(0)
message="我是：%s,我的电话是：%s，我线上状态是：%s" % (str1,num1,bool1)
#多个变量需要使用“()“，且注意使用顺序
#符号解释： %s：%：占位符；s：将变量以字符串的形式占位
print(message) #>>我是：XXX,我的电话是：123456，我线上状态是：False
#占位符号：%s %d %f

'''格式化精度控制'''
#未控制前：
float1=19.99
print("股价：%f"%float1) #>>股价：19.990000
#变量 float1 精度过度，默认以最大精度输出，即小数点后6位
#控制后：
print("股价：%.2f"%float1) #>>股价：19.99
#m.n控制法：
# m:控制数字宽度，如果数字自身小于设置的宽度，则不生效（自动加入空格补位）
# n:控制小数点精度，即精确到小数点后 n 位（会自动四舍五入,位数不足则添零）
# 示例：
# m：
print("股价：%20f"%float1) #>>股价：           19.990000
# n：
float2=21.44444
print("股价：%.1f"%float2) #>>股价：21.4
print("股价：%.10f"%float2) #>>股价：21.4444400000

'''字符串格式化 2'''
# 又名：快速格式化（f-string）
# 语法：f"{}" {}中填入变量名
# 示例：
print(f"我是：{str1},我的电话是：{num1}，我线上状态是：{bool1}")
#>>我是：XXX,我的电话是：123456，我线上状态是：False

'''字符串格式化 3'''
# 详见： ./初始表达式与表达式格式化字符串.py